<?php

use yii\db\Migration;

/**
 * Class m200424_183221_update_area_list
 */
class m200424_183221_update_area_list extends Migration {

    /**
     * {@inheritdoc}
     */
    public function safeUp() {
        $deleteAllRecordsFromAreaTable = "DELETE FROM area;";
        Yii::$app->db->createCommand($deleteAllRecordsFromAreaTable)->execute();

        $this->alterColumn('area', 'latitude', $this->decimal(18, 8));
        $this->alterColumn('area', 'longitude', $this->decimal(18, 8));

        $sql = 'INSERT INTO `area` (`area_id`, `city_id`, `area_name`, `area_name_ar`, `latitude`, `longitude`) VALUES
            (1,1,"Dasman","دسمان",29.38619599,47.99854829),
            (2,2,"Mubarakyia","المباركية",29.28462509,48.03892004),
            (3,4,"Ardhiya Herafiya","العارضية الحرفية",29.29406018,47.91085486),
            (4,3,"West Abu Ftirah Hirafyia","غرب أبو فطيرة الحرفية",29.19817357,48.05072289),
            (5,2,"Al Bidaa","البدع",29.31574885,48.08881096),
            (6,1,"Mansouriya","المنصورية",29.35783352,47.99462291),
            (7,4,"Ardhiya 6","العارضية 6",29.29422148,47.92206512),
            (8,1,"Nuzha","النزهة",29.34248914,47.99148158),
            (9,2,"Ministries Area","حي الوزارات",29.27121944,48.01735416),
            (10,1,"Faiha","الفيحاء",29.33837068,47.97864602),
            (11,4,"Dajeej","الضجيج",29.2620011,47.96221266),
            (12,1,"Bnaid Al-Qar","بنيد القار",29.3741029,48.00331086),
            (13,1,"Qadsiya","القادسية",29.3489315,48.00326849),
            (14,1,"Dasma","الدسمة",29.36524056,48.00130829),
            (15,7,"Waha","الواحة",29.34201963,47.65853133),
            (16,1,"Mirqab","المرقاب",29.36812259,47.98431982),
            (17,7,"Naeem","نعيم",29.33293236,47.69501629),
            (18,7,"Nahda","النهضة",29.30308908,47.85923841),
            (19,1,"Shamiya","الشامية",29.35155531,47.9666177),
            (20,4,"Rehab","رحاب",29.28432269,47.93851329),
            (21,1,"Daiya","الدعية",29.35991345,48.01421373),
            (22,1,"Yarmouk","اليرموك",29.31046039,47.96964708),
            (23,7,"Oyoun","العيون",29.32951578,47.65592242),
            (24,4,"Omariya","العمرية",29.29596015,47.95578755),
            (25,4,"Rabiya","الرابية",29.29487944,47.93740949),
            (26,3,"Al Masayel","المسايل",29.23818383,48.0888278),
            (27,1,"Shuwaikh Industrial-3","الشويخ الصناعية-3",29.32153256,47.93066431),
            (28,7,"Sulaibiya Industrial 1","الصليبية الصناعية 1",29.28854228,47.84031329),
            (29,1,"Abdulla Al-Salem","ضاحية عبدالله السالم",29.3522163,47.9818875),
            (30,6,"New Wafra","الوفرة الجديدة",28.60875078,48.01256383),
            (31,6,"Shalehat Zoor","شاليهات الزور",28.67429746,48.38426186),
            (32,4,"Riggai","الرقعي",29.30507832,47.91683053),
            (33,2,"Shuhada","الشهداء",29.27092893,48.03096419),
            (34,1,"Khaldiya","الخالدية",29.32567565,47.96441587),
            (35,1,"Adailiya","العديلية",29.32619511,47.9818927),
            (36,1,"Shuwaikh Industrial-2","الشويخ الصناعية-2",29.32276597,47.94895632),
            (37,6,"Khiran City","الخيران مدينة",28.664434,48.28119431),
            (38,1,"Rawda","الروضة",29.32934898,47.99895985),
            (39,1,"Qibla","القبلة",29.36909529,47.96995328),
            (40,1,"Sharq","الشرق",29.38119423,47.98669439),
            (41,2,"Mubarak Al-Abdullah","مبارك العبد الله",29.27387581,48.04686063),
            (42,1,"Ghornata","غرناطة",29.31654683,47.87275827),
            (43,1,"Kifan","الكيفان",29.33951551,47.96019622),
            (44,1,"Qortuba","قرطبة",29.31199095,47.98684859),
            (45,6,"Fahad Al-Ahmad","فهد الأحمد",29.12755442,48.10533733),
            (46,3,"Abu Hassaniah","أبو الحصانية",29.19773658,48.11060669),
            (47,1,"Northwest Sulaibikhat","شمال غرب الصليبخات",29.32733128,47.81099711),
            (48,1,"Surra","السرة",29.31374249,48.00741557),
            (49,4,"Ashbeliah","اشبلية",29.27315557,47.93860631),
            (50,2,"Shaab","الشعب",29.35059973,48.02680341),
            (51,6,"Dhaher","الظهر",29.16434581,48.06701747),
            (52,2,"Hitteen","حطين",29.28382102,48.01993233),
            (53,1,"Al Sour Gardens","حدائق السور",29.36347669,47.98266992),
            (54,6,"Hadiya","هدية",29.14514965,48.09164032),
            (55,2,"Al-Siddiq","الصديق",29.29518884,47.99206076),
            (56,6,"Riqqa","الرقة",29.14806823,48.10534908),
            (57,6,"Sabah Al-Ahmad 3","صباح الأحمد 3",28.77859891,48.03731276),
            (58,6,"Sabah Al-Ahmad 2","صباح الأحمد 2",28.79275139,48.05198538),
            (59,1,"Shuwaikh","الشويخ",29.35300985,47.95178201),
            (60,7,"Jahra","الجهراء",29.34821069,47.67272406),
            (61,2,"Al Salam","السلام",29.29734391,48.01443801),
            (62,4,"Ardhiya 4","العارضية 4",29.27839283,47.9169401),
            (63,4,"Ferdous","فردوس",29.28398703,47.87443069),
            (64,6,"Jaber Al-Ali","جابر العلي",29.16878447,48.08283545),
            (65,7,"Nasseem","النسيم",29.31913864,47.67769191),
            (66,7,"Taima","تيماء",29.328676,47.68162958),
            (67,6,"Egaila","العقيلة",29.17094731,48.10237416),
            (68,4,"Farwaniya","الفروانية",29.27776539,47.95921522),
            (69,2,"Zahra","الزهراء",29.27505888,47.99966112),
            (70,3,"Abu Ftaira","أبو فطيرة",29.19730565,48.10143538),
            (71,3,"Al-Qurain","القرين",29.2022429,48.07612202),
            (72,6,"Sabah Al-Ahmad 4","صباح الأحمد 4",28.76773145,48.06830219),
            (73,4,"Ardhiya","العارضية",29.28808032,47.89412908),
            (74,3,"Al-Qusour","القصور",29.21518595,48.07316576),
            (75,6,"Sabah Al-Ahmad 5","صباح الأحمد 5",28.7824724,48.08447566),
            (76,2,"Rumaithiya","الرميثية",29.3160272,48.07196596),
            (77,6,"South-Sabahiya","جنوب الصباحية",29.07840554,48.10597283),
            (78,4,"Al shadadyia","الشدادية",29.18247856,47.85861711),
            (79,1,"Mubarakiya Camps","المخيمات المباركية",29.31503648,47.9089135),
            (80,6,"Abu Halifa","أبو حليفة",29.12826839,48.12514568),
            (81,6,"Middle of Ahmadi","وسط الاحمدي",29.09118443,48.0699065),
            (82,4,"Rai","الري",29.30838759,47.94493835),
            (83,7,"Qasr","قصر",29.34187385,47.69359031),
            (84,3,"Mubarak Al-Kabeer","مبارك الكبير",29.18778596,48.08241613),
            (85,2,"Anjafa","أنجفة",29.29393555,48.08735866),
            (86,2,"Mishrif","مشرف",29.27682644,48.0670862),
            (87,2,"Jabriya","الجابرية",29.31855616,48.03274691),
            (88,2,"Hawalli","حولي",29.33638109,48.01935902),
            (89,6,"Sabah Al-Ahmad 1","صباح الأحمد 1",28.80188775,48.06276911),
            (90,7,"Kaerawan","القيروان",29.3026417,47.79847907),
            (91,3,"Al-Adan","العدان",29.23222613,48.06816286),
            (92,4,"Andalus","الأندلس",29.30303659,47.88300767),
            (93,6,"North Ahmadi","شمال الاحمدي",29.10147549,48.06625295),
            (94,4,"Sabah Al-Nasser","صباح الناصر",29.27141865,47.88721767),
            (95,6,"Ali Subah Al-Salem","علي صباح السالم",28.9572639,48.15281498),
            (96,6,"Sabahiya","الصباحية",29.10720737,48.10642438),
            (97,1,"Health Area","منطقة الصحة",29.32334085,47.89506188),
            (98,7,"Sulaibiya Industrial 2","الصليبية الصناعية 2",29.27829532,47.8533528),
            (99,6,"East Ahmadi","شرق الأحمدي",29.07896722,48.08838429),
            (100,3,"Subhan Industrial","سبحان الصناعية",29.23164896,48.00385285),
            (101,7,"Sulaibiya","الصليبية",29.28518049,47.82523478),
            (102,6,"Sabah Al-Ahmad Investment","صباح الأحمد الاستثمار",28.75625381,48.05786575),
            (103,4,"Khaitan","خيطان",29.28436451,47.97582286),
            (104,2,"Salwa","سلوى",29.29394237,48.07778785),
            (105,6,"South Ahmadi","جنوب الاحمدي",29.07688013,48.06150296),
            (106,6,"Mahboula","المهبولة",29.14776965,48.12098409),
            (107,2,"Bayan","البيان",29.29840546,48.04556693),
            (108,6,"Mangaf","المنقف",29.10525733,48.12781702),
            (109,3,"Al-Fnaitees","شركة القرين",29.22111533,48.09577701),
            (110,3,"Sabah Al-Salem","صباح السالم",29.25411286,48.06671568),
            (111,7,"North West Jahra","شمال غرب الجهراء",29.35479021,47.64968515),
            (112,4,"Jleeb Al-Shiyoukh","جليب الشيوخ",29.25705946,47.93436954),
            (113,6,"Mina Abdullah Refinery","ميناء عبدالله مصفاة",29.00540415,48.14920945),
            (114,1,"Doha","الدوحة",29.31906739,47.8038415),
            (115,6,"Shalehat Jleaa","شاليهات جليعة",28.88361954,48.2630666),
            (116,1,"Shalehat Doha","شاليهات الدوحة",29.37100294,47.76144079),
            (117,6,"Shalehat Al-Nuwaiseeb","شاليهات النويصيب",28.56162008,48.40891194),
            (118,7,"Jahra-Industrial","الجهراء الصناعية",29.32100414,47.65324892),
            (119,4,"Sabah Al-Salem University City","صباح السالم المدينة الجامعية",29.25707678,47.89788865),
            (120,6,"Sulaibyia Industrial 3","الصليبية الصناعية 3",29.20915215,47.82989281),
            (121,6,"Al-Fintas","الفنطاس",29.1705054,48.11841733),
            (122,3,"Messila","المسيلة",29.25188415,48.09317603),
            (123,1,"Sulaibikhat","الصليبخات",29.30776669,47.83544595),
            (124,7,"Amghara Industrial","أمغرة الصناعية",29.30346489,47.7605892),
            (125,1,"Shuwaikh Port","ميناء الشويخ",29.35205526,47.91894802),
            (126,1,"Shuwaikh Industrial-1","الشويخ الصناعية-1",29.33708549,47.92723413),
            (127,7,"Saad Al-Abdulla City","سعد العبدالله مدينة",29.31076253,47.71546237),
            (128,6,"Fahaheel","الفحيحيل",29.08036676,48.1284706),
            (129,6,"Shalehat Dbaayeh","شاليهات ضباعيه",28.92119623,48.20723681),
            (130,6,"kabd Agricultural","كبد الزراعية",29.09600577,47.80553349),
            (131,1,"Jaber Al-Ahmad","جابر الأحمد",29.33965128,47.76557174),
            (133,6,"Mina Abdulla","مينا عبد الله",28.97768638,48.09198017),
            (134,4,"Abdullah Mubarak Al-Sabah","عبد الله المبارك الصباح",29.23962761,47.90389844),
            (135,7,"Kabd","كبد",29.09657683,47.7423063),
            (136,6,"Shuaiba Industrial Western","الشعيبة الصناعية الغربية",29.00345002,48.1153753),
            (137,6,"Shuaiba Industrial esterly","شعيبة الصناعية",29.03415656,48.13982742),
            (138,6,"Al-Nuwaiseeb","النويصيب",28.57300982,48.37704587),
            (139,2,"Salmiya","السالمية",29.33477633,48.06786878),
            (141,4,"International Airport","مطار دولي",29.21558363,47.97125787),
            (142,6,"Sabah Al-Ahmad Services","صباح الأحمد الخدمات",28.79005355,48.06895796),
            (143,6,"Magwa","المقوع",29.1432993,48.04573107),
            (144,6,"Khiran","الخيران",28.62728292,48.38118578),
            (145,7,"Al Naayem","النعيم",29.2274153,47.27528682),
            (146,1,"Failaka Island","جزيرة فيلكا",29.4344455,48.33380558),
            (147,6,"Mina Al-Ahmadi Refinery","ميناء الأحمدي مصفاة",29.05500687,48.12248717),
            (148,6,"Zoor","الزور",28.71633222,48.33462513),
            (149,3,"Wista","وسطى",29.21910827,48.02887487),
            (150,7,"Jahra Camps","المخيمات الجهراء",29.35268144,47.70903213),
            (151,1,"Mina Doha","ميناء الدوحة",29.35976647,47.80366274),
            (152,7,"Sulaibiya Agricultural","الصليبية الزراعية",29.24811579,47.7728062),
            (153,7,"Subiya","الصبية",29.66251145,48.12588387),
            (154,6,"Bnaider","بنيدر",28.81697909,48.27589644),
            (155,6,"Wafra","وفرة",28.60247836,47.89740344),
            (156,7,"Umm Al-Aish","أم العيش",29.68276057,47.75948969),
            (157,7,"Abdally","العبدلي",29.98922904,47.78971889),
            (158,6,"Wafra Farms","مزارع الوفرة",28.58302006,48.16237805),
            (159,6,"Subiya","الصبية",28.64952716,48.34503769)
';
        Yii::$app->db->createCommand($sql)->execute();
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown() {
        return true;
    }

    /*
      // Use up()/down() to run migration code without a transaction.
      public function up()
      {

      }

      public function down()
      {
      echo "m200424_183221_update_area_list cannot be reverted.\n";

      return false;
      }
     */
}
