<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%area}}`.
 */
class m200119_140111_create_area_table extends Migration {

    /**
     * {@inheritdoc}
     */
    public function safeUp() {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            // http://stackoverflow.com/questions/766809/whats-the-difference-between-utf8-general-ci-and-utf8-unicode-ci
            $tableOptions = 'CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci ENGINE=InnoDB';
        }

        $tableSchema = Yii::$app->db->schema->getTableSchema('area');

        if ($tableSchema !== null) {
            return true;
        }

        $this->createTable('{{%area}}', [
            'area_id' => $this->primaryKey(),
            'city_id' => $this->integer()->notNull(),
            'area_name' => $this->string(255)->notNull(),
            'area_name_ar' => $this->string(255)->notNull(),
            'latitude' => $this->decimal(9, 6),
            'longitude' => $this->decimal(9, 6),
            "is_deleted" => $this->boolean()->defaultValue(0)
                ], $tableOptions);

        // creates index for column `city_id`
        $this->createIndex(
                'idx-area-city_id', 'area', 'city_id'
        );

        // add foreign key for table `city`
        $this->addForeignKey(
                'fk-area-city_id', 'area', 'city_id', 'city', 'city_id', 'CASCADE'
        );

        $sql = "INSERT INTO `area` (`area_id`, `city_id`, `area_name`, `area_name_ar`, `latitude`, `longitude`) VALUES
                (1, 1, 'Abdullah al-Salem', 'ضاحية عبدالله السالم', '29.351859', '47.983692'),
                (2, 1, 'Adailiya', 'العديلية', '29.328058', '47.983692'),
                (3, 1, 'Bneid Al Qar', 'بنيد القار', '29.373051', '48.004744'),
                (4, 1, 'Daiya', 'الدعية', '29.360440', '48.018371'),
                (5, 1, 'Dasma', 'الدسمة', '29.366434', '48.000698'),
                (6, 1, 'Dasman', 'دسمان', '29.387804', '47.999790'),
                (7, 4, 'Doha', 'الدوحة', '29.315517', '47.815570'),
                (8, 1, 'Faiha', 'الفيحاء', '29.340433', '47.978739'),
                (9, 1, 'Granada', 'غرناطة', '29.312521', '47.878553'),
                (10, 1, 'Jaber Al Ahmad', 'جابر الاحمد', '29.348166', '47.758825'),
                (11, 1, 'Kaifan', 'كيفان', '29.337567', '47.958935'),
                (12, 1, 'Khaldiya', 'الخالدية', '29.325196', '47.963885'),
                (14, 1, 'Mansouriya', 'المنصورية', '29.357338', '47.994836'),
                (15, 1, 'Mirqab', 'المرقاب', '29.366138', '47.983692'),
                (16, 1, 'Mubarekiya Camps and Collages', 'معسكرات المباركية', '29.313741', '47.909455'),
                (17, 1, 'Nuzha', 'النزهة', '29.341390', '47.993598'),
                (18, 1, 'Qadsiya', 'القادسية', '29.349962', '48.003505'),
                (19, 1, 'Jibla', 'قبلة', '29.369934', '47.968836'),
                (20, 1, 'Qortuba', 'قرطبة', '29.312348', '47.986168'),
                (21, 1, 'Rawda', 'الروضة', '29.329013', '47.998551'),
                (22, 1, 'Salhiya', 'صالحية', '29.363824', '47.966386'),
                (23, 1, 'Shamiya', 'الشامية', '29.350899', '47.968836'),
                (24, 1, 'Sharq', 'شرق', '29.382323', '47.988644'),
                (25, 1, 'Shuwaikh Residential', 'شويخ السكنية', '29.354695', '47.953984'),
                (26, 1, 'Sulaibikhat', 'الصليبيخات', '29.315559', '47.840260'),
                (27, 1, 'Surra', 'السرة', '29.313966', '48.008443'),
                (28, 1, 'Yarmouk', 'اليرموك', '29.312822', '47.968836'),
                (30, 2, 'Bayan', 'بيان', '29.297990', '48.051087'),
                (31, 2, 'Hawally', 'حولي', '29.333298', '48.015893'),
                (33, 2, 'Jabriya', 'الجابرية', '29.321911', '48.031675'),
                (34, 2, 'Maidan Hawally', 'ميدان حولي', '29.337376', '48.041139'),
                (35, 2, 'Mishref', 'مشرف', '29.276103', '48.065471'),
                (37, 2, 'Rumaithiya', 'الرميثية', '29.318030', '48.075392'),
                (38, 2, 'Salam', 'السلام', '29.296629', '48.013415'),
                (39, 2, 'Salmiya', 'السالمية', '29.335294', '48.071561'),
                (40, 2, 'Salwa', 'سلوى', '29.296487', '48.079379'),
                (41, 2, 'Shaab', 'الشعب', '29.349965', '48.028283'),
                (42, 2, 'Shuhada', 'الشهداء', '29.270894', '48.033240'),
                (43, 2, 'Al-Siddeeq', 'الصديق', '29.293778', '47.993598'),
                (44, 2, 'Zahra', 'الزهراء', '29.278063', '47.996074'),
                (45, 3, 'Abu Fatira', 'أبو فطيرة', '29.197372', '48.102684'),
                (46, 3, 'Abu Al Hasaniya', 'أبو الحصانية', '29.190906', '48.113853'),
                (47, 3, 'Adan', 'العدان', '29.228440', '48.065471'),
                (48, 3, 'Al-Masayel', 'المسايل', '29.239367', '48.087796'),
                (49, 3, 'Qurain', 'القرين', '29.202195', '48.077872'),
                (50, 3, 'Qusor', 'القصور', '29.214601', '48.072911'),
                (51, 3, 'Coast Strip B', 'الشريط الساحلى', NULL, NULL),
                (52, 3, 'Fnaitees', 'فنيطيس', '29.220757', '48.095239'),
                (53, 3, 'Messila', 'المسيله', '29.250674', '48.094248'),
                (54, 3, 'Mubarak Al Kabeer', 'مبارك الكبير', '29.187155', '48.084724'),
                (56, 3, 'Sabhan Industrial Area', 'صبحان الصناعية', '29.230903', '48.003505'),
                (57, 3, 'South Wista', 'جنوب وسطى', '29.231709', '48.040437'),
                (58, 3, 'West Abu Fatira Small Industrial', 'غرب أبو فطيرة الصناعية', '29.187957', '48.045186'),
                (59, 3, 'Wista', 'وسطي', '29.230698', '48.037519'),
                (60, 4, 'Abbasiya', 'عباسيه', '29.261273', '47.933046'),
                (61, 4, 'Abdullah Al Mubarak Al Sabah', 'عبدالله المبارك الصباح', '29.243378', '47.900341'),
                (62, 4, 'Abraq Khaitan', 'أبرق خيطان', '29.295332', '47.972326'),
                (64, 4, 'Andalous', 'الأندلس', '29.304205', '47.884732'),
                (65, 4, 'Ardiya', 'العارضية', '29.287567', '47.897092'),
                (66, 4, 'Ardiya Small Industrial', 'العارضية الصناعية', '29.294712', '47.909455'),
                (67, 4, 'Ardiya Storage Zone', 'منطقة تخزين العارضية', '29.295672', '47.924294'),
                (69, 4, 'Al-Dajeej', 'الضجيج', '29.261645', '47.962647'),
                (70, 4, 'South Khaitan - Exhibits', 'منطقة المعارض جنوب خيطان', '29.276617', '47.977733'),
                (71, 4, 'Farwaniya', 'الفروانية', '29.281596', '47.960252'),
                (72, 4, 'Firdous', 'الفردوس', '29.286122', '47.874846'),
                (73, 4, 'Jeleeb Al-Shuyoukh', 'جليب الشيوخ', '29.255222', '47.936663'),
                (74, 4, 'Khaitan', 'خيطان', '29.279973', '47.976263'),
                (75, 4, 'Omariya', 'العمرية', '29.297211', '47.955858'),
                (76, 4, 'Rabia', 'الرابية', '29.296630', '47.939137'),
                (77, 4, 'Rai', 'الري', '29.308054', '47.944086'),
                (78, 2, 'Hateen', 'حطين', '29.284243', '48.018371'),
                (79, 4, 'Ishbiliya', 'إشبيلية', '29.272833', '47.939137'),
                (80, 2, 'Mubarak Al-Abdullah', 'مبارك العبدالله - غرب مشرف', '29.277204', '48.045251'),
                (81, 3, 'Sabah Al Salem', 'صباح السالم', '29.256564', '48.062605'),
                (82, 1, 'Kuwait City', 'مدينة الكويت', '29.375859', '47.977405'),
                (83, 4, 'Rehab', 'الرحاب', '29.285207', '47.934189'),
                (84, 1, 'Shuwaikh Industrial', 'الشويخ الصناعية', '29.331366', '47.936663'),
                (85, 2, 'Al-Bidea', 'البدع', '29.315423', '48.089166'),
                (86, 6, 'Abu Halifa', 'أبو حليفة', '29.128633', '48.117405'),
                (87, 6, 'Ahmadi', 'الأحمدي', '29.085504', '48.054379'),
                (88, 6, 'Al-Riqqa', 'الرقة', '29.150787', '48.105140'),
                (89, 6, 'Assabahiyah', 'الصباحية', '29.107026', '48.096893'),
                (90, 6, 'Dahar', 'الظهر', '29.163880', '48.057818'),
                (91, 6, 'Eqaila', 'العقيلة', '29.170833', '48.093632'),
                (92, 6, 'Fahad Al Ahmad', 'فهد الأحمد', '29.128054', '48.099605'),
                (93, 6, 'Fahaheel', 'الفحيحيل', '29.081097', '48.121995'),
                (94, 6, 'Fintas', 'الفنطاس', '29.173157', '48.117679'),
                (96, 6, 'Hadiya', 'هدية', '29.144453', '48.082212'),
                (97, 6, 'Jaber Al Ali', 'جابر العلي', '29.170083', '48.085000'),
                (98, 6, 'Mahboula', 'المهبولة', '29.148880', '48.113387'),
                (99, 6, 'Mangaf', 'المنقف', '29.105927', '48.119454'),
                (100, 1, 'Shuwaikh Administrative', 'شويخ الإدارية', '29.345207', '47.944652'),
                (101, 1, 'Shuwaikh Industrial 1', 'شويخ الصناعية 1', '29.336119', '47.930028'),
                (102, 4, 'Rigai', 'الرقعي', '29.306690', '47.925696'),
                (103, 4, 'Sabah Al Nasser', 'صباح الناصر', '29.273602', '47.867530'),
                (104, 1, 'Kuwait Free Trade Zone', 'المنطقة الحرة', '29.352145', '47.901923'),
                (105, 7, 'Naeem', 'النعيم', '29.333393', '47.693838'),
                (106, 7, 'Amgarah Industrial Area', 'منطقة أمغرة الصناعية', '29.301535', '47.758416'),
                (107, 7, 'Jahra', 'الجهراء', '29.327986', '47.640767'),
                (108, 7, 'Naseem', 'النسيم', '29.319314', '47.660260'),
                (109, 7, 'Oyoun', 'العيون', '29.332673', '47.654092'),
                (110, 1, 'Qairawan', 'القيروان', '29.303985', '47.795923'),
                (111, 7, 'Qasr', 'القصر', '29.340549', '47.672486'),
                (112, 7, 'Saad Al Abdullah', 'سعد العبدالله', '29.313301', '47.693447'),
                (113, 7, 'Sulaibiya', 'الصليبية', '29.282850', '47.793486'),
                (114, 7, 'Al Sulaibiya Industrial 1', 'الصليبية الصناعية 1', '29.286854', '47.833275'),
                (115, 7, 'Al Sulaibiya Industrial 2', 'الصليبية الصناعية 2', '29.283086', '47.857108'),
                (116, 7, 'Taima\'', 'تيماء', '29.329026', '47.670636'),
                (117, 7, 'Waha', 'الواحة', '29.344576', '47.658130'),
                (118, 2, 'Anjafa', 'أنجفة', '29.297939', '48.087227'),
                (119, 4, 'Al-Shadadiya', 'الشدادية', '29.259276', '47.896957'),
                (120, 1, 'Shuwaikh Industrial 2', 'شويخ الصناعية 2', '29.324354', '47.939661'),
                (121, 1, 'Shuwaikh Industrial 3', 'شويخ الصناعية 3', '29.321903', '47.928452'),
                (122, 1, 'Nahdha', 'النهضة', '29.304531', '47.859881'),
                (123, 1, 'North West Al-Sulaibikhat', 'شمال غرب الصليبيخات', '29.327324', '47.807614'),
                (124, 6, 'Ali Sabah Al Salem', 'علي صباح السالم', '28.957320', '48.145604'),
                (125, 6, 'Shuaiba Block 1', 'الشعيبة قطعه 1', '29.048984', '48.133103'),
                (126, 6, 'West Industrial Shuaiba', 'الشعيبة الصناعية الغربية', '29.012088', '48.110331'),
                (127, 6, 'Shalayhat Mina Abdullah', 'شاليهات ميناء عبدالله', '28.970485', '48.172955'),
                (128, 6, 'Shalayhat Al Dubaiya', 'الضباعية', '28.918279', '48.192992'),
                (129, 6, 'Al-Julaia\'a', 'الجليعة', '28.883725', '48.252833'),
                (130, 6, 'Bnaider', 'بنيدر', '28.800663', '48.258669'),
                (131, 6, 'Zour', 'الزور', '28.712485', '48.305142'),
                (132, 6, 'Al Khiran', 'الخيران', '28.656633', '48.295335'),
                (133, 6, 'Al-Nuwaiseeb', 'النويصيب', '28.585259', '48.346367'),
                (134, 6, 'Al Wafrah', 'الوفرة', '28.605514', '48.035926'),
                (135, 6, 'Sabah Al Ahmad', 'صباح الأحمد', '28.777166', '48.029964'),
                (136, 4, 'Kuwait International Airport', 'مطار الكويت الدولي', '29.239757', '47.971149'),
                (137, 4, 'Sheikh Saad Aviation Terminal', 'مبنى الشيخ سعد للطيران العام', '29.224968', '47.992477')";

        Yii::$app->db->createCommand($sql)->execute();
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown() {
        $this->dropForeignKey('fk-area-city_id', 'area');
        $this->dropIndex('idx-area-city_id', 'area');
        $this->dropTable('{{%area}}');
    }

}
